# -*- coding: utf-8 -*-

# =============================================================================
# =======概述
# 创建日期：2018-05-20
# 编码人员：王学良
# 简述：文件类
#
# =======使用说明
# 
#
# =======日志
# 1.2018-05-20 王学良创建文件

# =======后续改进
# 暂时只实现选择文件夹载入项目，后续需要实现选择项目文件载入项目
# =============================================================================
class NormalDatafileModel(object):
    
    def __init__(self):
        
#        文件路径
        self.file_dir = None
#        文件名
        self.filename = None
#        下面的属性目前都是不可更改的，所以定为私有属性，后续做时间同步或升降频可能会变动
#        文件大小
        self._filesize = None
#        文件中的参数
        self._paras_in_file = []
#        采样开始时间
        self._time_begin = None
#        采样结束时间
        self._time_end = None
#        采样频率
        self._sample_frequency = None
